---
kind: method
id: M:Autodesk.Revit.DB.ParameterUtils.GetAllBuiltInParameters
source: html/bbcac12c-c02a-3747-55d0-95bc3f6d2bb2.htm
---
# Autodesk.Revit.DB.ParameterUtils.GetAllBuiltInParameters Method

Gets the identifiers of all built-in parameters.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetAllBuiltInParameters()
```

## Returns
The built-in parameter identifiers.